Sync documentation and pumped core-v0.4.0
